Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: In the last few months, the adoption of RESTEasy _reactive_ has been incredible! We have received many questions and, obviously, bug reports. The central question is about the usage of Hibernate ORM.
ja_jp: ここ数ヶ月、RESTEasy _reactive_の採用は信じられないほど進んでいます。多くの質問や、当然ながらバグレポートも寄せられています。中心となる質問は、Hibernate ORMの使い方についてです。

source: In the later case, the `quarkus.tls.key-store.pem.password` or `quarkus.tls.key-store.pem.<name>.password` property must be set to the password used to decrypt the private key.
ja_jp: 後者の場合、`quarkus.tls.key-store.pem.password` または `quarkus.tls.key-store.pem.<name>.password` プロパティーは、秘密鍵の複合に使用するパスワードに設定する必要があります。

source: In the latest evolution, the tool started being called by its current name, Migration Toolkit for Applications, or MTA. With the release 5.0.0, it started seeding the first rules to help migrate applications from the Spring Boot framework to Quarkus. That happened, among other things due to the feedback that developer teams working with modern Java patterns, and deploying on Kubernetes, were interested in. It happened that these teams were using Spring Boot but quickly became interested in Quarkus as a way to improve speed, required resources, and productivity. With version 5.1.1, MTA broke the 120 rules barrier to ease this transformation path. Now, closing the circle, MTA in the coming release 5.1.3 of MTA (expected by mid March 2021) will include rules to upgrade code written for Quarkus 1.11, so it can efficiently be moved to 1.12. A piece of cake!
ja_jp: 最新の進化の中で、このツールは現在の名前であるMigration Toolkit for Applications（MTA）と呼ばれるようになりました。5.0.0のリリースでは、Spring BootフレームワークからQuarkusへのアプリケーションの移行を支援する最初のルールの提供が開始されました。これは、最新のJavaパターンを使用し、Kubernetesにデプロイする開発者チームが興味を持っているというフィードバックを受けたことなどによります。これらのチームは、Spring Bootを使用していましたが、スピード、必要なリソース、生産性を向上させる方法として、すぐにQuarkusに興味を持つようになりました。MTAはバージョン5.1.1で120ルールの壁を突破し、このトランスフォーメーションの道を容易にしました。そして、今後MTAのリリース5.1.3（2021年3月中旬までに予定）では、Quarkus 1.11向けに書かれたコードをアップグレードするためのルールが含まれており、1.12への移行を効率的に行うことができます。簡単ですね!

source: In the new model, Dev Services are started after the augmentation but before the application's actual launch.
ja_jp: 新しいモデルでは、Dev Services はオーグメンテーションの後、アプリケーションの実際の起動の前に開始されます。

source: In the past months an increasing number of users have tried this feature, taking advantage of the performance benefits it offers, but also helping us to discover bugs, edge cases, and compatibility issues with various Jackson features that we have addressed one by one. Overall, we have received positive feedback from the community, so we have decided to make the obvious next step.
ja_jp: ここ数カ月、この機能を試すユーザーが増え、提供されるパフォーマンス上の利点を活用するだけでなく、バグ、エッジケース、さまざまな Jackson 機能との互換性の問題を発見するのに役立ってくれました。これらは一つずつ対処してきました。全体として、コミュニティーから肯定的なフィードバックをいただいているため、次の明白なステップを踏むことを決定しました。

source: In the preceding code, the `get` method would return a `User` whose `id` is always `null` while the `create` method would never include `id` in the JSON it sends to the REST API.
ja_jp: 上記のコードでは、`get` メソッドは `id` が常に `null` の `User` を返し、`create` メソッドは REST API に送信する JSON に `id` を含めません。

source: In the preceding implementation, tenants are resolved from the request path. If no tenant can be inferred, `null` is returned to indicate that the default tenant configuration should be used.
ja_jp: 前述の実装では、テナントはリクエストパスから解決されます。 テナントを推測できない場合は、デフォルトのテナント設定を使用する必要があることを示すために `null` が返されます。

source: In the previous example generated price will be broadcast to both outbound channels. The following example selectively sends messages to multiple outgoing channels using the `Targeted` container object, containing key as channel name and value as message payload.
ja_jp: 前の例では、生成された価格は両方の送信チャネルにブロードキャストされます。 次の例では、 `Targeted` コンテナーオブジェクトを使用して、複数の送信チャネルにメッセージを選択的に送信します。 このオブジェクトは、キーをチャンネル名、値をメッセージのペイロードとして含んでいます。

source: In the previous example the database transaction (inner) will commit followed by the Kafka transaction (outer). If you wish to commit the Kafka transaction first and the database transaction second, you need to nest them in the reverse order.
ja_jp: 前の例では、データベーストランザクション (内部) がコミットされ、続いて Kafka トランザクション (外部) がコミットされます。最初に Kafka トランザクションをコミットし、次にデータベーストランザクションをコミットしたい場合は、それらを逆の順序でネストする必要があります。

source: In the previous section, we created a simple liveness health check procedure which states whether our application is running or not. In this section, we will create a readiness health check which will be able to state whether our application is able to process requests.
ja_jp: 前のセクションでは、アプリケーションが実行されているかどうかを示す単純な liveness ヘルスチェックプロシージャを作成しました。このセクションでは、アプリケーションがリクエストを処理することができるかどうかを示すことができるReadinessヘルスチェックを作成します。

source: In the previous snippet we were able to simply use `reflection-config.json` instead of specifying the entire path of the file simply because it was added to `src/main/resources`. If the file had been added to another directory, the proper file path would have had to be specified manually.
ja_jp: 前のスニペットでは、 `src/main/resources` に追加されたため、ファイルのパス全体を指定するのではなく、単に `reflection-config.json` を使用することができました。ファイルが別のディレクトリーに追加されていた場合は、適切なファイルパスを手動で指定する必要がありました。

source: In the previous snippet we were able to simply use `resources-config.json` instead of specifying the entire path of the file simply because it was added to `src/main/resources`. If the file had been added to another directory, the proper file path would have had to be specified manually.
ja_jp: 前のスニペットでは、 `src/main/resources` に追加されたため、ファイルのパス全体を指定するのではなく、単に `resources-config.json` を使用することができました。ファイルが別のディレクトリーに追加されていた場合は、適切なファイルパスを手動で指定する必要がありました。

source: In the project root directory:
ja_jp: プロジェクトのルートディレクトリー:

source: In the project using it, don't forget to add the dependency on the module providing your implementation. Then, in the configuration, just add:
ja_jp: これを使用するプロジェクトでは、実装を提供するモジュールへの依存を忘れずに追加してください。そして、設定では、以下の追加だけが必要です:

source: In the provided example, `KeycloakTestResourceLifecycleManager` registers two users: `alice` and `admin`. By default: * The user `alice` has the `user` role, which you can customize by using a `keycloak.token.user-roles` system property. * The user `admin` has both the `user` and `admin` roles, which you can customize by using the `keycloak.token.admin-roles` system property.
ja_jp: 上記の例では、 `KeycloakTestResourceLifecycleManager` が `alice` と `admin` の 2 人のユーザーを登録します。 デフォルトでは、* ユーザー `alice` には `user` ロールがあります。このロールは、 `keycloak.token.user-roles` システムプロパティーを使用してカスタマイズできます。 * ユーザー `admin` には `user` と `admin` の両方のロールがあります。これらのロールは、 `keycloak.token.admin-roles` システムプロパティーを使用してカスタマイズできます。

source: In the provided example, both tenants configure OIDC `web-app` applications to use an authorization code flow to authenticate users and require session cookies to be generated after authentication. After Google or GitHub authenticates the current user, the user gets returned to the `/signed-in` area for authenticated users, such as a secured resource path on the JAX-RS endpoint.
ja_jp: 提供された例では、両方のテナントが OIDC `web-app` アプリケーションを設定して、認可コードフローを使用してユーザーを認証し、認証後にセッション Cookie を生成することを要求します。 Google または GitHub が現在のユーザーを認証すると、ユーザーは、JAX-RS エンドポイント上のセキュアなリソースパスなど、認証されたユーザーの `/signed-in` 領域に戻されます。

source: In the relevant Dev UI page
ja_jp: 関連する開発 UI ページ

source: In the replication mode, it is possible to reconfigure the Redis client to skip automatic discovery of the topology:
ja_jp: レプリケーションモードでは、Redis クライアントを再設定してトポロジーの自動検出をスキップできます。

source: In the response, the `Base price` will be quoted -accordingly to the defined DMN model- for a total amount of `500`; this is visible in the response payload:
ja_jp: レスポンスでは、定義されたDMNモデルに従って、 `Base price` は合計金額 `500` と見積もられます。これはレスポンスのペイロードで確認できます:

source: In the response, the list of the approved applications will be returned:
ja_jp: レスポンスでは、承認されたアプリケーションのリストが返されます:

source: In the response, the person should be approved as an adult and that should also be visible in the response payload.
ja_jp: レスポンスの中では、本人は成人として認められているべきであり、それもレスポンスのペイロードの中で見えるようにしなければなりません。

source: In the response, you should see the prediction, that should be _virginica_:
ja_jp: レスポンスの中に、予測値が表示されているはずですが、それは _virginica_ のはずです:

source: In the root directory, create a `docker-compose.yml` file with the following content:
ja_jp: ルートディレクトリーに、以下の内容の `docker-compose.yml` ファイルを作成します:

source: In the root directory, create a `nginx.conf` file with the following content:
ja_jp: ルートディレクトリーに、以下の内容の `nginx.conf` ファイルを作成します:

source: In the same class, add:
ja_jp: 同じクラスに以下を追加します。

source: In the same directory, create an `import.sql` file, which inserts a few fruits, so we don't start with an empty database in dev mode:
ja_jp: 同じディレクトリに、 `import.sql` ファイルを作成します。このファイルにはいくつかのフルーツが挿入されており、開発モードで空のデータベースから始めないようになっています。

source: In the same fashion as `hasRole`, users can use `hasAnyRole` to check if the logged in user has any of the specified roles.
ja_jp: `hasRole` と同じように、ユーザーは `hasAnyRole` を使用して、ログインしているユーザーが指定されたロールのいずれかを持っているかどうかを確認できます。

source: In the same fashion as `hasRole`, users can use `hasAnyRole` to check if the logged-in user has any of the specified roles.
ja_jp: `hasRole` と同じように、ユーザーは `hasAnyRole` を使用して、ログインしているユーザーが指定されたロールのいずれかを持っているかどうかを確認できます。

source: In the same vein, the `BigDecimal` class has a static initializer that actually performs a fair amount of work. Initializing `BigDecimal` can take a noticeable amount of time.
ja_jp: 同様に、 `BigDecimal` クラスには、実際にはかなりの量の作業を行う静的初期化子があります。 `BigDecimal` の初期化には、無視できない時間がかかることがあります。

source: In the second terminal, query the `ConsumedMovieResource` resource with `curl`:
ja_jp: 2 番目のターミナルで、`ConsumedMovieResource` リソースを `curl` でクエリーします。

source: In the sentinel mode, it is possible to configure automatic failover of _master_ connections:
ja_jp: sentinel モードでは、_ マスター _ 接続の自動フェイルオーバーを設定できます。

source: In the snippet above you can see a _feature()_ method which is annotated with _@BuildStep_ and returns a new FeatureBuildItem. It exposes the name of the feature (logging-cloudwatch) displayed in the log during application bootstrap. The second method _addCloudWatchHandler()_ initializes the extensions runtime configurations provided by the LoggingCloudWatchConfig and LoggingCloudWatchHandlerValueFactory class. Luckily there is a LogHandlerBuildItem provided, so we can overwrite the existing log handler by adding our own implementation. There are lots of other BuildItems provided so it’s definitely worth it, taking a look at it if you want to create your own extension. The parameter of this method is a config class which will be described in the following snippet.
ja_jp: 上のスニペットでは、 _@BuildStep_でアノテーションされ、新しいFeatureBuildItemを返す _feature()_メソッドを見ることができます。このメソッドは、アプリケーションの起動時にログに表示される機能の名前（logging-cloudwatch）を公開します。2 番目のメソッド _addCloudWatchHandler()_は、LoggingCloudWatchConfig と LoggingCloudWatchHandlerValueFactory クラスによって提供されるエクステンションのランタイム構成を初期化します。幸い、LogHandlerBuildItemが提供されているので、独自の実装を追加して既存のログハンドラを上書きすることができます。他にもたくさんのBuildItemが提供されているので、独自のエクステンションを作りたい方はぜひ参考にしてみてください。このメソッドのパラメータは、以下のスニペットで説明されるコンフィグクラスです。

source: In the spirit of the times, the Quarkus Team virtually presents a big, loud, and bold, rock & roll mega-stadium tour.
ja_jp: 時勢に合わせ、Quarkus チームはバーチャルで、大規模で騒々しく、大胆なロックンロールのメガスタジアムツアーをお届けします。

source: In the terminal running the application, you will see:
ja_jp: アプリケーションを実行しているターミナルでは、以下のように表示されます:

source: In the test class, the RemoteCache can be mocked.
ja_jp: テスト・クラスでは、RemoteCache をモックできます。

source: In the test mode, the rendering results of injected and type-safe templates are recorded in the managed `io.quarkus.qute.RenderedResults` which is registered as a CDI bean. You can inject `RenderedResults` in a test or any other CDI bean and assert the results. However, it's possible to set the `quarkus.qute.test-mode.record-rendered-results` configuration property to `false` to disable this feature.
ja_jp: テストモードの場合、注入されたタイプセーフテンプレートのレンダリング結果は、CDI Bean として登録されている管理対象の `io.quarkus.qute.RenderedResults` に記録されます。 テストまたは他の CDI Bean に `RenderedResults` を注入し、結果をアサートできます。 この機能は、`quarkus.qute.test-mode.record-rendered-results` 設定プロパティーを `false` に設定することで無効にできます。

source: In the test, we will send movies in a loop and check if the `ConsumedMovieResource` returns what we send.
ja_jp: テストでは、ムービーをループで送信し、送信したものを `ConsumedMovieResource` が返すかどうかを確認します。

source: In the third one, post a few movies:
ja_jp: 3番目のターミナルで、いくつかの movie をポストします。

source: In the traditional and imperative approach, frameworks assign a thread to handle the request. So, the whole processing of the request runs on this worker thread. This model does not scale very well. Indeed, to handle multiple concurrent requests, you need multiple threads; and so your application concurrency is constrained by the number of threads. In addition, these threads are blocked as soon as your code interacts with remote services. So, it leads to inefficient usage of the resources, as you may need more threads, and each thread, as they are mapped to OS threads, has a cost in terms of memory and CPU.
ja_jp: 伝統的な命令型のアプローチでは、フレームワークはリクエストを処理するスレッドを割り当てます。つまり、リクエストの処理全体がこのワーカースレッド上で実行されるのです。このモデルは、スケールがあまりよくありません。実際、複数の同時リクエストを処理するためには、複数のスレッドが必要となり、アプリケーションの同時実行性はスレッドの数によって制限されます。さらに、これらのスレッドは、コードがリモートサービスとやり取りするとすぐにブロックされます。そのため、より多くのスレッドが必要となり、各スレッドはOSのスレッドにマッピングされているため、メモリやCPUのコストがかかり、リソースの非効率的な使用につながります。

source: In the unfortunate case where the reference causing the issue is made by a 3rd party library, that you cannot modify, you should consider one of the following:
ja_jp: 問題の原因となる参照がサードパーティライブラリで作られており、それを変更することができない場合は、次のいずれかを検討する必要があります:

source: In the wake of this vulnerability we’ve seen other similar issues show up - none as severe as the log4j vulnerability but we are actively monitoring it and if things change we will upgrade this blog and https://github.com/quarkusio/quarkus/discussions/22108[our announcement topic] in the official Quarkus Github Discussions.
ja_jp: この脆弱性の後、我々は他の同様の問題が現れるのを見てきました - log4jの脆弱性ほど深刻ではありませんが、我々は積極的に監視しており、状況が変わればこのブログとQuarkus公式Github Discussionsの発表トピックをアップグレードします。

source: In theory, you can use <<annotations_transformer_build_item,an `AnnotationsTransformer`>> to achieve the same goal. However, there are few differences that make `InjectionPointsTransformer` more suitable for this particular task: (1) annotation transformers are applied to all classes during bean discovery, whereas `InjectionPointsTransformer` is only applied to discovered injection points after bean discovery; (2) with `InjectionPointsTransformer` you don't need to handle various types of injection points (field, parameters of initializer methods, etc.).
ja_jp: 理論的には、<<annotations_transformer_build_item,an `AnnotationsTransformer`>> を使用して同じ目標を達成できます。ただし、次の多少の違いがあるため、このタスクには `InjectionPointsTransformer` の方が適しています。その違いとは次のとおりです。(1) アノテーショントランスフォーマーは Bean 検出中にすべてのクラスに適用されますが、 `InjectionPointsTransformer` は Bean 検出後に検出されたインジェクションポイントにのみ適用されます。(2) `InjectionPointsTransformer` を使用すると、さまざまなタイプのインジェクションポイント (フィールド、初期化メソッドのパラメーターなど) を処理する必要がありません。

source: In these cases, delaying the infringing class initialization at runtime might be the solution and, to achieve that, you can use the `--initialize-at-run-time=<package or class>` configuration knob.
ja_jp: これらの場合、実行時に違反しているクラスの初期化を遅らせることが解決策になる可能性があり、それを達成するには、 `--initialize-at-run-time=<package or class>` 設定ノブを使用できます。

source: In these cases, you can find all the keys managed by the default cache using `KEYS my-cache:*`, and all the keys managed by the `expensiveResourceCache` cache using: `KEYS my-expensive-cache:*`.
ja_jp: このような場合、デフォルトキャッシュで管理されているすべての鍵は `KEYS my-cache:*` で、 `expensiveResourceCache` キャッシュで管理されているすべての鍵は `KEYS my-expensive-cache:*` で検索できます。

source: In this application we consider an indexed entity (the author) is the root of a "document": the author "owns" books it references through associations, which *cannot* be updated independently of the author.
ja_jp: このアプリケーションでは、インデックスが作成されたエンティティー (author) が "ドキュメント" のルートであるとみなされます。 author は、関連性を通じて参照する book を "所有” します。 つまり、author のみを更新することは *できません*。

source: In this application, we are going to test an elementary object, but we support complicated constraints and can validate graphs of objects. Create the `org.acme.validation.Book` class with the following content:
ja_jp: 今回のアプリケーションでは、基本のオブジェクトをテストすることになりますが、複雑な制約にも対応しており、オブジェクトのグラフを検証することができます。以下の内容で `org.acme.validation.Book` クラスを作成します。

source: In this article we will explore how to configure Quarkus applications to allow Cryostat to connect to them, allowing Cryostat to communicate with Quarkus and provide its JDK Flight Recorder collection, storage, and analysis tooling.
ja_jp: この記事では、CryostatがQuarkusと通信し、JDK Flight Recorderの収集、保存、および分析ツールを提供できるように、Quarkusアプリケーションを設定する方法について説明します。

source: In this blog post we are going to look at the new styling and other new options available in OpenAPI and Swagger UI Quarkus extensions (version 1.10+).
ja_jp: 今回のブログ記事では、OpenAPIとSwagger UIのQuarkusエクステンション(バージョン1.10+)で利用できる新しいスタイリングやその他の新しいオプションについて見ていきたいと思います。

source: In this blog post, you will learn how to:
ja_jp: このブログ記事では、以下の方法をご紹介します。

source: In this case select the `Keycloak Admin` option in the right top corner, login as `admin:admin`, select the test realm and the client which Dev UI for Keycloak is configured with and add `http://localhost:8080/q/dev/io.quarkus.quarkus-oidc/provider` to `Valid Redirect URIs`. If you used `-Dquarkus.http.port` when starting Quarkus then change `8080` to the value of `quarkus.http.port`.
ja_jp: この場合、右上隅の `Keycloak Admin` オプションを選択し、 `admin:admin` としてログインし、Dev UI for Keycloak が設定されているテストレルムとクライアントを選択して、 `Valid Redirect URIs` に `http://localhost:8080/q/dev/io.quarkus.quarkus-oidc/provider` を追加します。Quarkus の起動に `-Dquarkus.http.port` を使用した場合は、 `8080` を `quarkus.http.port` の値に変更します。

source: In this case since `name` is not set, the corresponding property will be `greeting.suffix`.
ja_jp: この場合、 `name` が設定されていないので、対応するプロパティは `greeting.suffix` となります。

source: In this case the `allServers()` `Map` will contain one `Server` element with the key `my-server`.
ja_jp: この場合、 `allServers()` `Map` には、 `my-server` をキーとする `Server` 要素が1つ含まれます。

source: In this case the default value for `quarkus.native.builder-image` will be provided by the platform. The user will still be able to set the desired value for `quarkus.native.builder-image` in its `application.properties`, of course. But in case it's not customized by the user, the default value will be coming from the platform properties. A platform properties file for the example above would contain (the actual value is provided as an example):
ja_jp: この場合、 `quarkus.native.builder-image` のデフォルト値はプラットフォームによって提供されます。もちろん、ユーザーは `application.properties` で `quarkus.native.builder-image` に希望の値を設定することができます。しかし、ユーザーがカスタマイズしていない場合は、デフォルト値はプラットフォームのプロパティから提供されます。上記の例のプラットフォームのプロパティファイルには、以下のようなものが含まれています（実際の値は例として提供されています）。

source: In this case the default value for `quarkus.native.builder-image` will be provided by the platform. The user will still be able to set the desired value for `quarkus.native.builder-image` in its `application.properties`, of course. But in case it's not customized by the user, the default value will be coming from the platform properties. A platform properties file for the example above would contain:
ja_jp: この場合、 `quarkus.native.builder-image` のデフォルト値はプラットフォームによって提供されます。もちろん、ユーザーは `application.properties` で `quarkus.native.builder-image` に希望の値を設定することができます。しかし、ユーザーがカスタマイズしていない場合は、デフォルト値はプラットフォームのプロパティから提供されます。上記の例のプラットフォームのプロパティファイルには、以下のようなものが含まれています（実際の値は例として提供されています）。

source: In this case you are testing that `FrontendResource` can propagate the access tokens acquired by `OpenID Connect Dev UI`.
ja_jp: この場合、 `FrontendResource` が `OpenID Connect Dev UI` により取得されたアクセストークンを伝搬できるかどうかをテストしています。

source: In this case, `io.quarkus.container.image.openshift.deployment.OpenshiftBuild` should be included in one of the extension deployment dependencies and implement `java.util.function.BooleanSupplier`. At build time, the Quarkus bootstrap will create an instance of it and register `io.quarkus.container.image.openshift` capability only if its `getAsBoolean()` method returns true.
ja_jp: この場合、 `io.quarkus.container.image.openshift.deployment.OpenshiftBuild` は、エクステンションのデプロイメント依存関係の1つに含まれ、 `java.util.function.BooleanSupplier` を実装する必要があります。ビルド時に、Quarkusのブートストラップはそのインスタンスを作成し、その `getAsBoolean()` メソッドがtrueを返す場合にのみ、 `io.quarkus.container.image.openshift` ケイパビリティを登録します。

source: In this case, `my.prop` from `InMemoryConfigSource` will only be used if the config engine is unable to find a value in xref:config-reference.adoc#system-properties[System Properties], xref:config-reference.adoc#environment-variables[Environment Variables from System] or xref:config-reference.adoc#env-file[Environment Variables from .env file] in this order.
ja_jp: この場合、 `InMemoryConfigSource` からの `my.prop` は、設定エンジンが link:config-reference.html#system-properties[システムプロパティ]、 link:config-reference.html#environment-variables[システムからの環境変数]、 link:config-reference.html#env-file[.env ファイルからの環境変数]の順に値を見つけられない場合にのみ使用されます。

source: In this case, an optimized value resolver is generated automatically and used at runtime
ja_jp: この場合、最適化されたバリューリゾルバーが自動的に生成され、実行時に使用されます。

source: In this case, configure `OidcClient` as follows:
ja_jp: この場合、 `OidcClient` を次のように設定します。

source: In this case, properties for a specific profile may reside in an `application-{profile}.properties` named file. The previous example may be expressed as:
ja_jp: この場合、特定のプロファイルのプロパティは、 `application-{profile}.properties` という名前のファイルに格納されます。先ほどの例は次のように表現できます。

source: In this case, query parameters for nested values use the `.` notation. For example:
ja_jp: この場合、入れ子になった値のクエリパラメーターは `.` 表記法を使用します。例えば、以下のようになります。

source: In this case, select the *Keycloak Admin* option in the top right corner, login as `admin:admin`, select the test realm and the client which Dev UI for Keycloak is configured with, and add `http://localhost:8080/q/dev-ui/io.quarkus.quarkus-oidc/keycloak-provider` to `Valid Redirect URIs`. If you used `-Dquarkus.http.port` when starting Quarkus, then change `8080` to the value of `quarkus.http.port`
ja_jp: この場合、右上隅の *Keycloak Admin* オプションを選択し、 `admin:admin` としてログインし、テストレルムと、Keycloak 用の Dev UI が設定されているクライアントを選択し、 `http://localhost:8080/q/dev-ui/io.quarkus.quarkus-oidc/keycloak-provider` を `Valid Redirect URIs` に追加します。 Quarkus の起動時に `-Dquarkus.http.port` を使用した場合は、 `8080` を `quarkus.http.port` の値に変更します。

source: In this case, select the *Keycloak Admin* option in the top right corner, login as `admin:admin`, select the test realm and the client which Dev UI for Keycloak is configured with, and add `http://localhost:8080/q/dev-ui/quarkus-oidc/keycloak-provider` to `Valid Redirect URIs`. If you used `-Dquarkus.http.port` when starting Quarkus, then change `8080` to the value of `quarkus.http.port`
ja_jp: この場合、右上隅の *Keycloak Admin* オプションを選択し、`admin:admin` としてログインし、テストレルムと、Keycloak 用 Dev UI が設定されているクライアントを選択し、`http://localhost:8080/q/dev-ui/quarkus-oidc/keycloak-provider` を `Valid Redirect URIs` に追加します。Quarkus の起動時に `-Dquarkus.http.port` を使用した場合は、`8080` を `quarkus.http.port` の値に変更します。

source: In this case, since `greeting.name` was configured to be `Optional*` up above, the corresponding property value will be an empty `Optional` and execution will continue normally. This would be the case even if there was a default value configured: the default value is *not* used if the property is explicitly cleared in the configuration.
ja_jp: この場合、 `greeting.name` は上記の `Optional*` になるように設定されているため、対応するプロパティー値は空の `Optional` になり、実行は通常どおり続行されます。これは、デフォルト値が設定されている場合でも当てはまります。プロパティーが設定で明示的にクリアされている場合、デフォルト値は *使用されません*。

source: In this case, the Dev UI is not very helpful because the Quarkus OIDC `web-app` application controls the authorization code flow and acquires the tokens.
ja_jp: この場合、Quarkus OIDC `web-app` アプリケーションが認可コードフローを制御し、トークンを取得するため、Dev UI はあまり役に立ちません。
